Catalogs/ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ТранспортныеСредства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топливо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйЗнакПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформляютсяПутевыеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТранспортныеСредства/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененоТранспортноеСредство", Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РегистрационныйЗнакПрицепаПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыПрицеп(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаПрицепаПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыПрицеп(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформляютсяПутевыеЛистыПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СобственникКонтрагентПриИзменении(Элемент)
	
	УстановитьОграничениеТипаСобственник(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоПриИзменении(Элемент)
	
	ТопливоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		
		ПараметрыЗначения = Новый Структура;
		ПараметрыЗначения.Вставить("ВидНоменклатуры",     ВыбранноеЗначение);
		ПараметрыЗначения.Вставить("КодЕдиницыИзмерения", "112");
		
		РаботаСНоменклатуройКлиент.НоменклатураОбработкаВыбора(Элемент, ПараметрыЗначения, СтандартнаяОбработка);
		// Т.к. процедура РаботаСНоменклатуройКлиент.НоменклатураОбработкаВыбора возвращает результат во второй параметр,
		// то следует переопределить выбранное значение.
		ВыбранноеЗначение = ПараметрыЗначения;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Вставить("ВидыНоменклатуры", "Топливо");
	ПараметрыПолученияДанных.Отбор.Вставить("ЭтоТопливо", Истина);
	
	РаботаСНоменклатуройКлиент.НоменклатураАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Вставить("ВидыНоменклатуры", "Топливо");
	ПараметрыПолученияДанных.Вставить("ЭтоТопливо", Истина);
	
	РаботаСНоменклатуройКлиент.НоменклатураОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПодсказкаНормыРасхода(Топливо)
	
	СвойстваНормыРасхода = Справочники.ТранспортныеСредства.СвойстваНормыРасходаТоплива(Топливо);
	
	Возврат СвойстваНормыРасхода.Подсказка;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущиеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Марка, РегистрационныйЗнак");
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПредыдущиеЗначения", ПредыдущиеЗначения);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Элементы.ГруппаНормаРасхода.РасширеннаяПодсказка.Заголовок =
		Справочники.ТранспортныеСредства.ПодсказкаОписаниеНормыМинтранса();
	
	ПодсказкаНормаРасхода = ПодсказкаНормыРасхода(Объект.Топливо);
	
	СобственникКонтрагент = ТипЗнч(Объект.Собственник) = Тип("СправочникСсылка.Контрагенты");
	УстановитьОграничениеТипаСобственник(ЭтотОбъект);
	УстановитьЗаголовокГруппыПрицеп(ЭтотОбъект);
	
	ВедетсяУчетПоПутевымЛистам = ПолучитьФункциональнуюОпцию("ВедетсяУчетПоПутевымЛистам");
	Элементы.ГруппаПрицеп.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьДоставкуАвтотранспортом");
	Элементы.ПодсказкаПрицеп.Видимость = ВедетсяУчетПоПутевымЛистам;
	Элементы.ГруппаПутевойЛист.Видимость = ВедетсяУчетПоПутевымЛистам;
	
КонецПроцедуры

&НаСервере
Процедура ТопливоПриИзмененииНаСервере()
	
	ПодсказкаНормаРасхода = ПодсказкаНормыРасхода(Объект.Топливо);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОграничениеТипаСобственник(Форма)
	
	Если Форма.СобственникКонтрагент Тогда
		ТипСтрока = "СправочникСсылка.Контрагенты";
	Иначе
		ТипСтрока = "СправочникСсылка.Организации";
	КонецЕсли;
	
	Форма.Элементы.Собственник.ОграничениеТипа = Новый ОписаниеТипов(ТипСтрока);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппыПрицеп(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Если ЗначениеЗаполнено(Объект.МаркаПрицепа) И ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа) Тогда
		ЗаголовокГруппы = СтрШаблон(НСтр("ru='Прицеп: %1 (%2)'"), Объект.МаркаПрицепа, Объект.РегистрационныйЗнакПрицепа);
	ИначеЕсли ЗначениеЗаполнено(Объект.МаркаПрицепа) Или ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа) Тогда
		ЗаголовокГруппы = СтрШаблон(НСтр("ru='Прицеп: %1%2'"), Объект.МаркаПрицепа, Объект.РегистрационныйЗнакПрицепа);
	Иначе
		ЗаголовокГруппы = НСтр("ru='Прицеп: Без прицепа'");
	КонецЕсли;
	Элементы.ГруппаПрицеп.ЗаголовокСвернутогоОтображения = ЗаголовокГруппы;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ПодсказкаНормаРасхода.Видимость = Не ПустаяСтрока(Форма.ПодсказкаНормаРасхода);
	Элементы.ГруппаИнформацияДляПутевогоЛиста.Доступность = Объект.ОформляютсяПутевыеЛисты;
	
КонецПроцедуры

#КонецОбласти
